Update diagrams
